Учет_трудозатрат_EDT/src/Documents/ут_УстановкаУровней/ут_УстановкаУровней.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ут_УстановкаУровней</name>
  <registerRecords>InformationRegister.ут_УровниРаботника</registerRecords>
  <tabularSections>
    <name>Уровни</name>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>CatalogRef.ут_Уровни</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_трудозатрат_EDT/src/InformationRegisters/ут_УровниРаботника/ут_УровниРаботника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ут_УровниРаботника</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Уровень</name>
    <type>
      <types>CatalogRef.ут_Уровни</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_трудозатрат_EDT/src/Documents/ут_УстановкаУровней/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ут_УровниРаботника.Записывать = Истина;
	Для Каждого ТекСтрокаУровни Из Уровни Цикл
		Движение = Движения.ут_УровниРаботника.Добавить();
		Движение.Период = Дата;
		Движение.Уровень = ТекСтрокаУровни.Уровень;
		Движение.Сумма = ТекСтрокаУровни.Сумма;
	КонецЦикла;

КонецПроцедуры
